export { default as PlayIconCustom } from "./PlayIconCustom";
export const BarMenuIcon = ({ width = "1em", height = "1em" }) => (
  <svg
    data-v-be424fa8=""
    viewBox="0 0 16 16"
    width={width}
    height={height}
    focusable="false"
    role="img"
    aria-label="list"
    xmlns="http://www.w3.org/2000/svg"
    fill="currentColor"
  >
    <g data-v-be424fa8="">
      <path
        fillRule="evenodd"
        d="M2.5 12a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5zm0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5zm0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5z"
      ></path>
    </g>
  </svg>
);

export const BlockEyesIcon = ({ width = "14px", height = "14px" }) => (
  <svg
    viewBox="0 0 16 16"
    width={width}
    height={height}
    focusable="false"
    role="img"
    ariaLabel="eye slash"
    xmlns="http://www.w3.org/2000/svg"
    fill="currentColor"
  >
    <g transform="translate(8 8) scale(1.5 1.5) translate(-8 -8)">
      <path d="M13.359 11.238C15.06 9.72 16 8 16 8s-3-5.5-8-5.5a7.028 7.028 0 0 0-2.79.588l.77.771A5.944 5.944 0 0 1 8 3.5c2.12 0 3.879 1.168 5.168 2.457A13.134 13.134 0 0 1 14.828 8c-.058.087-.122.183-.195.288-.335.48-.83 1.12-1.465 1.755-.165.165-.337.328-.517.486l.708.709z"></path>
      <path d="M11.297 9.176a3.5 3.5 0 0 0-4.474-4.474l.823.823a2.5 2.5 0 0 1 2.829 2.829l.822.822zm-2.943 1.299.822.822a3.5 3.5 0 0 1-4.474-4.474l.823.823a2.5 2.5 0 0 0 2.829 2.829z"></path>
      <path d="M3.35 5.47c-.18.16-.353.322-.518.487A13.134 13.134 0 0 0 1.172 8l.195.288c.335.48.83 1.12 1.465 1.755C4.121 11.332 5.881 12.5 8 12.5c.716 0 1.39-.133 2.02-.36l.77.772A7.029 7.029 0 0 1 8 13.5C3 13.5 0 8 0 8s.939-1.721 2.641-3.238l.708.709zm10.296 8.884-12-12 .708-.708 12 12-.708.708z"></path>
    </g>
  </svg>
);

export const BackToTopIcon = () => (
  <svg
    data-v-7830e9e4=""
    width="60"
    height="60"
    viewBox="0 0 60 60"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <rect
      data-v-7830e9e4=""
      width="60"
      height="60"
      rx="8"
      fill="#0F0F0F"
    ></rect>
    <path
      data-v-7830e9e4=""
      d="M18.3333 18.3333H41.6666"
      stroke="#FF6500"
      strokeWidth="2.5"
      strokeLinecap="round"
    ></path>
    <path
      data-v-7830e9e4=""
      d="M29.4253 22.214L21.5086 29.7537C20.9639 30.2725 21.3311 31.1904 22.0833 31.1904H26.1667C26.6269 31.1904 27 31.5635 27 32.0238V44.1666C27 44.6269 27.3731 45 27.8333 45H32.1667C32.6269 45 33 44.6269 33 44.1666V32.0238C33 31.5635 33.3731 31.1904 33.8333 31.1904H37.9167C38.6689 31.1904 39.0361 30.2725 38.4914 29.7537L30.5747 22.214C30.2529 21.9075 29.7471 21.9075 29.4253 22.214Z"
      fill="#FF6500"
    ></path>
  </svg>
);

export const DotIcon = () => (
  <svg
    data-v-41c05bc4=""
    viewBox="0 0 16 16"
    width="1em"
    height="1em"
    focusable="false"
    role="img"
    aria-label="record fill"
    xmlns="http://www.w3.org/2000/svg"
    fill="currentColor"
    style={{ color: "rgb(97, 97, 97)" }}
  >
    <g
      data-v-41c05bc4=""
      transform="translate(8 8) scale(0.3 0.3) translate(-8 -8)"
    >
      <path fillRule="evenodd" d="M8 13A5 5 0 1 0 8 3a5 5 0 0 0 0 10z"></path>
    </g>
  </svg>
);

export const PlayIcon = () => (
  <svg
    data-v-41c05bc4=""
    viewBox="0 0 16 16"
    width="1em"
    height="1em"
    focusable="false"
    role="img"
    ariaLabel="play fill"
    xmlns="http://www.w3.org/2000/svg"
    fill="currentColor"
  >
    <g
      data-v-41c05bc4=""
      transform="translate(8 8) scale(2 2) translate(-8 -8)"
    >
      <path d="m11.596 8.697-6.363 3.692c-.54.313-1.233-.066-1.233-.697V4.308c0-.63.692-1.01 1.233-.696l6.363 3.692a.802.802 0 0 1 0 1.393z"></path>
    </g>
  </svg>
);

export const BackWardsIcon = ({ width = "22px", height = "22px" }) => (
  <svg
    width={width}
    height={height}
    fill="currentColor"
    viewBox="0 0 1024 1024"
    aria-hidden="true"
  >
    <path
      d="M455.68 262.712889l-67.072 79.644444-206.904889-174.08 56.775111-38.627555a468.48 468.48 0 1 1-201.216 328.817778l103.310222 13.141333a364.487111 364.487111 0 0 0 713.614223 139.605333 364.373333 364.373333 0 0 0-479.971556-435.541333l-14.904889 5.973333 96.312889 81.066667zM329.955556 379.505778h61.610666v308.167111H329.955556zM564.167111 364.088889c61.269333 0 110.933333 45.511111 110.933333 101.717333v135.566222c0 56.149333-49.664 101.660444-110.933333 101.660445s-110.933333-45.511111-110.933333-101.660445V465.749333c0-56.149333 49.664-101.660444 110.933333-101.660444z m0 56.490667c-27.249778 0-49.322667 20.252444-49.322667 45.226666v135.566222c0 24.974222 22.072889 45.169778 49.322667 45.169778 27.192889 0 49.265778-20.195556 49.265778-45.169778V465.749333c0-24.917333-22.072889-45.169778-49.265778-45.169777z"
      p-id="7377"
    ></path>
  </svg>
);

export const ForWardsIcon = ({ width = "22px", height = "22px" }) => (
  <svg
    width={width}
    height={height}
    fill="currentColor"
    viewBox="0 0 1024 1024"
    aria-hidden="true"
  >
    <path
      d="M561.948444 262.712889l67.015112 79.644444 206.961777-174.08-56.832-38.627555a468.48 468.48 0 1 0 201.216 328.817778l-103.310222 13.141333a364.487111 364.487111 0 0 1-713.557333 139.605333 364.373333 364.373333 0 0 1 479.971555-435.541333l14.904889 5.973333-96.369778 81.066667zM329.955556 379.505778h61.610666v308.167111H329.955556zM564.167111 364.088889c61.269333 0 110.933333 45.511111 110.933333 101.717333v135.566222c0 56.149333-49.664 101.660444-110.933333 101.660445s-110.933333-45.511111-110.933333-101.660445V465.749333c0-56.149333 49.664-101.660444 110.933333-101.660444z m0 56.490667c-27.249778 0-49.322667 20.252444-49.322667 45.226666v135.566222c0 24.974222 22.072889 45.169778 49.322667 45.169778 27.192889 0 49.265778-20.195556 49.265778-45.169778V465.749333c0-24.917333-22.072889-45.169778-49.265778-45.169777z"
      p-id="7407"
    ></path>
  </svg>
);

export const PcaIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
  >
    <title>icon/footer/computer@1x</title>
    <g
      id="icon/footer/computer"
      stroke="none"
      strokeWidth="1"
      fill="none"
      fillRule="evenodd"
    >
      <path
        d="M19.8,3.6 C20.4627417,3.6 21,4.1372583 21,4.8 L21,15.6 C21,16.2627417 20.4627417,16.8 19.8,16.8 L4.2,16.8 C3.5372583,16.8 3,16.2627417 3,15.6 L3,4.8 C3,4.1372583 3.5372583,3.6 4.2,3.6 L19.8,3.6 Z M19.2,5.4 L4.8,5.4 L4.8,15 L19.2,15 L19.2,5.4 Z M6.96,18.6 L17.04,18.6 C17.2388225,18.6 17.4,18.7611775 17.4,18.96 L17.4,20.04 C17.4,20.2388225 17.2388225,20.4 17.04,20.4 L6.96,20.4 C6.76117749,20.4 6.6,20.2388225 6.6,20.04 L6.6,18.96 C6.6,18.7611775 6.76117749,18.6 6.96,18.6 Z"
        id="形状结合"
        fill="#FFFFFF"
        fillRule="nonzero"
      ></path>
    </g>
  </svg>
);

export const PhoneIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
  >
    <title>icon/footer/phone@3x</title>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/phone" fill="#FFFFFF" fillRule="nonzero">
        <g transform="translate(5.000000, 2.000000)" id="形状结合">
          <path d="M12,0 C13.1045695,0 14,0.8954305 14,2 L14,18 C14,19.1045695 13.1045695,20 12,20 L2,20 C0.8954305,20 0,19.1045695 0,18 L0,2 C0,0.8954305 0.8954305,0 2,0 L12,0 Z M12,15 L2,15 L2,18 L12,18 L12,15 Z M7,15.5 C7.55228475,15.5 8,15.9477153 8,16.5 C8,17.0522847 7.55228475,17.5 7,17.5 C6.44771525,17.5 6,17.0522847 6,16.5 C6,15.9477153 6.44771525,15.5 7,15.5 Z M12,2 L2,2 L2,13 L12,13 L12,2 Z"></path>
        </g>
      </g>
    </g>
  </svg>
);

export const TvIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
  >
    <title>icon/footer/tv@3x</title>
    <defs>
      <rect id="path-1" x="0" y="0" width="24" height="24"></rect>
    </defs>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/TV">
        <mask id="mask-2" fill="white">
          <use xlinkHref="#path-1"></use>
        </mask>
        <use id="矩形" fill="#FFFFFF" opacity="0" xlinkHref="#path-1"></use>
        <path
          d="M16.0812672,4.13816693 L16.1406119,4.20614284 L16.7283972,5.01515984 C16.8726749,5.21374106 16.8495754,5.48286526 16.6857572,5.65421622 L16.6177813,5.71356096 L15.534,6.5 L19,6.5 C20.1045695,6.5 21,7.3954305 21,8.5 L21,17.5 C21,18.6045695 20.1045695,19.5 19,19.5 L5,19.5 C3.8954305,19.5 3,18.6045695 3,17.5 L3,8.5 C3,7.3954305 3.8954305,6.5 5,6.5 L8.289,6.5 L7.20614284,5.71356096 C6.98273897,5.55124855 6.93321456,5.23856371 7.09552697,5.01515984 L7.68331222,4.20614284 C7.84562464,3.98273897 8.15830947,3.93321456 8.38171335,4.09552697 L11.6177813,6.44666798 L11.678,6.5 L12.145,6.5 L12.2061428,6.44666798 L15.4422108,4.09552697 C15.640792,3.95124927 15.9099162,3.97434881 16.0812672,4.13816693 Z M19,8.5 L5,8.5 L5,17.5 L19,17.5 L19,8.5 Z M17,14.5 C17.5522847,14.5 18,14.9477153 18,15.5 C18,16.0522847 17.5522847,16.5 17,16.5 C16.4477153,16.5 16,16.0522847 16,15.5 C16,14.9477153 16.4477153,14.5 17,14.5 Z"
          id="形状结合"
          fill="#FFFFFF"
        ></path>
      </g>
    </g>
  </svg>
);

export const PcIcon = () => (
  <svg
    width="20px"
    height="20px"
    viewBox="0 0 24 24"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
  >
    <title>icon/footer/电脑</title>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/Computer" fill="#FFFFFF" fillRule="nonzero">
        <path
          d="M3,7 C3,5.8954305 3.8954305,5 5,5 L19,5 C20.1045695,5 21,5.8954305 21,7 L21,18 L21.5,18 C21.7761424,18 22,18.2238576 22,18.5 L22,19.5 C22,19.7761424 21.7761424,20 21.5,20 L2.5,20 C2.22385763,20 2,19.7761424 2,19.5 L2,18.5 C2,18.2238576 2.22385763,18 2.5,18 L3,18 L3,7 Z M19,7 L5,7 L5,16 L19,16 L19,7 Z"
          id="形状结合"
        ></path>
      </g>
    </g>
  </svg>
);

export const PlayDisabled = () => (
  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
    <path
      fill="none"
      stroke="currentColor"
      strokeLinecap="round"
      strokeLinejoin="round"
      strokeWidth={1.5}
      d="M2 7h19m-4.5-5l-3 5m-4-5l-3 5m5 14c-4.478 0-6.718 0-8.109-1.391S2 15.979 2 11.5c0-4.478 0-6.718 1.391-8.109S7.021 2 11.5 2c4.478 0 6.718 0 8.109 1.391S21 7.021 21 11.5M15 15l3.5 3.5m0 0L22 22m-3.5-3.5L15 22m3.5-3.5L22 15"
      color="currentColor"
    ></path>
  </svg>
);

export const PersonIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    stroke="currentColor"
    fill="currentColor"
    strokeWidth={0}
    viewBox="0 0 448 512"
    height={height}
    width={width}
    xmlns="http://www.w3.org/2000/svg"
  >
    <path d="M224 256A128 128 0 1 0 224 0a128 128 0 1 0 0 256zm-45.7 48C79.8 304 0 383.8 0 482.3C0 498.7 13.3 512 29.7 512H418.3c16.4 0 29.7-13.3 29.7-29.7C448 383.8 368.2 304 269.7 304H178.3z" />
  </svg>
);

export const SettingsIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    stroke="currentColor"
    fill="currentColor"
    strokeWidth={0}
    viewBox="0 0 512 512"
    height={height}
    width={width}
    xmlns="http://www.w3.org/2000/svg"
  >
    <path d="M495.9 166.6c3.2 8.7 .5 18.4-6.4 24.6l-43.3 39.4c1.1 8.3 1.7 16.8 1.7 25.4s-.6 17.1-1.7 25.4l43.3 39.4c6.9 6.2 9.6 15.9 6.4 24.6c-4.4 11.9-9.7 23.3-15.8 34.3l-4.7 8.1c-6.6 11-14 21.4-22.1 31.2c-5.9 7.2-15.7 9.6-24.5 6.8l-55.7-17.7c-13.4 10.3-28.2 18.9-44 25.4l-12.5 57.1c-2 9.1-9 16.3-18.2 17.8c-13.8 2.3-28 3.5-42.5 3.5s-28.7-1.2-42.5-3.5c-9.2-1.5-16.2-8.7-18.2-17.8l-12.5-57.1c-15.8-6.5-30.6-15.1-44-25.4L83.1 425.9c-8.8 2.8-18.6 .3-24.5-6.8c-8.1-9.8-15.5-20.2-22.1-31.2l-4.7-8.1c-6.1-11-11.4-22.4-15.8-34.3c-3.2-8.7-.5-18.4 6.4-24.6l43.3-39.4C64.6 273.1 64 264.6 64 256s.6-17.1 1.7-25.4L22.4 191.2c-6.9-6.2-9.6-15.9-6.4-24.6c4.4-11.9 9.7-23.3 15.8-34.3l4.7-8.1c6.6-11 14-21.4 22.1-31.2c5.9-7.2 15.7-9.6 24.5-6.8l55.7 17.7c13.4-10.3 28.2-18.9 44-25.4l12.5-57.1c2-9.1 9-16.3 18.2-17.8C227.3 1.2 241.5 0 256 0s28.7 1.2 42.5 3.5c9.2 1.5 16.2 8.7 18.2 17.8l12.5 57.1c15.8 6.5 30.6 15.1 44 25.4l55.7-17.7c8.8-2.8 18.6-.3 24.5 6.8c8.1 9.8 15.5 20.2 22.1 31.2l4.7 8.1c6.1 11 11.4 22.4 15.8 34.3zM256 336a80 80 0 1 0 0-160 80 80 0 1 0 0 160z" />
  </svg>
);

export const LogoutIcon = ({ width = "20px", height = "20px" }) => (
  <svg
    stroke="currentColor"
    fill="currentColor"
    strokeWidth={0}
    viewBox="0 0 512 512"
    height={height}
    width={width}
    xmlns="http://www.w3.org/2000/svg"
  >
    <path d="M502.6 278.6c12.5-12.5 12.5-32.8 0-45.3l-128-128c-12.5-12.5-32.8-12.5-45.3 0s-12.5 32.8 0 45.3L402.7 224 192 224c-17.7 0-32 14.3-32 32s14.3 32 32 32l210.7 0-73.4 73.4c-12.5 12.5-12.5 32.8 0 45.3s32.8 12.5 45.3 0l128-128zM160 96c17.7 0 32-14.3 32-32s-14.3-32-32-32L96 32C43 32 0 75 0 128L0 384c0 53 43 96 96 96l64 0c17.7 0 32-14.3 32-32s-14.3-32-32-32l-64 0c-17.7 0-32-14.3-32-32l0-256c0-17.7 14.3-32 32-32l64 0z" />
  </svg>
);
