import React from 'react';

import type { IconProps } from './index';

export const PlayIcon: React.FC<IconProps> = ({ width = '20px', height = '20px', ...props }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 16 16"
    xmlns="http://www.w3.org/2000/svg"
    fill="currentColor"
    {...props}
  >
    <g transform="translate(8 8) scale(2 2) translate(-8 -8)">
      <path d="m11.596 8.697-6.363 3.692c-.54.313-1.233-.066-1.233-.697V4.308c0-.63.692-1.01 1.233-.696l6.363 3.692a.802.802 0 0 1 0 1.393z" />
    </g>
  </svg>
);

export const BackWardsIcon: React.FC<IconProps> = ({
  width = '22px',
  height = '22px',
  ...props
}) => (
  <svg
    width={width}
    height={height}
    fill="currentColor"
    viewBox="0 0 1024 1024"
    aria-hidden="true"
    {...props}
  >
    <path d="M455.68 262.712889l-67.072 79.644444-206.904889-174.08 56.775111-38.627555a468.48 468.48 0 1 1-201.216 328.817778l103.310222 13.141333a364.487111 364.487111 0 0 0 713.614223 139.605333 364.373333 364.373333 0 0 0-479.971556-435.541333l-14.904889 5.973333 96.312889 81.066667zM329.955556 379.505778h61.610666v308.167111H329.955556zM564.167111 364.088889c61.269333 0 110.933333 45.511111 110.933333 101.717333v135.566222c0 56.149333-49.664 101.660444-110.933333 101.660445s-110.933333-45.511111-110.933333-101.660445V465.749333c0-56.149333 49.664-101.660444 110.933333-101.660444z m0 56.490667c-27.249778 0-49.322667 20.252444-49.322667 45.226666v135.566222c0 24.974222 22.072889 45.169778 49.322667 45.169778 27.192889 0 49.265778-20.195556 49.265778-45.169778V465.749333c0-24.917333-22.072889-45.169778-49.265778-45.169777z" />
  </svg>
);

export const ForWardsIcon: React.FC<IconProps> = ({
  width = '22px',
  height = '22px',
  ...props
}) => (
  <svg
    width={width}
    height={height}
    fill="currentColor"
    viewBox="0 0 1024 1024"
    aria-hidden="true"
    {...props}
  >
    <path d="M561.948444 262.712889l67.015112 79.644444 206.961777-174.08-56.832-38.627555a468.48 468.48 0 1 0 201.216 328.817778l-103.310222 13.141333a364.487111 364.487111 0 0 1-713.557333 139.605333 364.373333 364.373333 0 0 1 479.971555-435.541333l14.904889 5.973333-96.369778 81.066667zM329.955556 379.505778h61.610666v308.167111H329.955556zM564.167111 364.088889c61.269333 0 110.933333 45.511111 110.933333 101.717333v135.566222c0 56.149333-49.664 101.660444-110.933333 101.660445s-110.933333-45.511111-110.933333-101.660445V465.749333c0-56.149333 49.664-101.660444 110.933333-101.660444z m0 56.490667c-27.249778 0-49.322667 20.252444-49.322667 45.226666v135.566222c0 24.974222 22.072889 45.169778 49.322667 45.169778 27.192889 0 49.265778-20.195556 49.265778-45.169778V465.749333c0-24.917333-22.072889-45.169778-49.265778-45.169777z" />
  </svg>
);

export const PcaIcon: React.FC<IconProps> = ({ width = '20px', height = '20px', ...props }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    xmlns="http://www.w3.org/2000/svg"
    {...props}
  >
    <title>icon/footer/computer@1x</title>
    <g id="icon/footer/computer" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <path
        d="M19.8,3.6 C20.4627417,3.6 21,4.1372583 21,4.8 L21,15.6 C21,16.2627417 20.4627417,16.8 19.8,16.8 L4.2,16.8 C3.5372583,16.8 3,16.2627417 3,15.6 L3,4.8 C3,4.1372583 3.5372583,3.6 4.2,3.6 L19.8,3.6 Z M19.2,5.4 L4.8,5.4 L4.8,15 L19.2,15 L19.2,5.4 Z M6.96,18.6 L17.04,18.6 C17.2388225,18.6 17.4,18.7611775 17.4,18.96 L17.4,20.04 C17.4,20.2388225 17.2388225,20.4 17.04,20.4 L6.96,20.4 C6.76117749,20.4 6.6,20.2388225 6.6,20.04 L6.6,18.96 C6.6,18.7611775 6.76117749,18.6 6.96,18.6 Z"
        id="形状结合"
        fill="var(--primary-color)"
        fillRule="nonzero"
      />
    </g>
  </svg>
);

export const PhoneIcon: React.FC<IconProps> = ({ width = '20px', height = '20px', ...props }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    xmlns="http://www.w3.org/2000/svg"
    {...props}
  >
    <title>icon/footer/phone@3x</title>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/phone" fill="var(--primary-color)" fillRule="nonzero">
        <g transform="translate(5.000000, 2.000000)" id="形状结合">
          <path d="M12,0 C13.1045695,0 14,0.8954305 14,2 L14,18 C14,19.1045695 13.1045695,20 12,20 L2,20 C0.8954305,20 0,19.1045695 0,18 L0,2 C0,0.8954305 0.8954305,0 2,0 L12,0 Z M12,15 L2,15 L2,18 L12,18 L12,15 Z M7,15.5 C7.55228475,15.5 8,15.9477153 8,16.5 C8,17.0522847 7.55228475,17.5 7,17.5 C6.44771525,17.5 6,17.0522847 6,16.5 C6,15.9477153 6.44771525,15.5 7,15.5 Z M12,2 L2,2 L2,13 L12,13 L12,2 Z" />
        </g>
      </g>
    </g>
  </svg>
);

export const TvIcon: React.FC<IconProps> = ({ width = '20px', height = '20px', ...props }) => (
  <svg
    width={width}
    height={height}
    viewBox="0 0 24 24"
    xmlns="http://www.w3.org/2000/svg"
    {...props}
  >
    <title>icon/footer/tv@3x</title>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/TV">
        <rect
          id="矩形"
          fill="var(--primary-color)"
          opacity="0"
          x="0"
          y="0"
          width="24"
          height="24"
        />
        <path
          d="M16.0812672,4.13816693 L16.1406119,4.20614284 L16.7283972,5.01515984 C16.8726749,5.21374106 16.8495754,5.48286526 16.6857572,5.65421622 L16.6177813,5.71356096 L15.534,6.5 L19,6.5 C20.1045695,6.5 21,7.3954305 21,8.5 L21,17.5 C21,18.6045695 20.1045695,19.5 19,19.5 L5,19.5 C3.8954305,19.5 3,18.6045695 3,17.5 L3,8.5 C3,7.3954305 3.8954305,6.5 5,6.5 L8.289,6.5 L7.20614284,5.71356096 C6.98273897,5.55124855 6.93321456,5.23856371 7.09552697,5.01515984 L7.68331222,4.20614284 C7.84562464,3.98273897 8.15830947,3.93321456 8.38171335,4.09552697 L11.6177813,6.44666798 L11.678,6.5 L12.145,6.5 L12.2061428,6.44666798 L15.4422108,4.09552697 C15.640792,3.95124927 15.9099162,3.97434881 16.0812672,4.13816693 Z M19,8.5 L5,8.5 L5,17.5 L19,17.5 L19,8.5 Z M17,14.5 C17.5522847,14.5 18,14.9477153 18,15.5 C18,16.0522847 17.5522847,16.5 17,16.5 C16.4477153,16.5 16,16.0522847 16,15.5 C16,14.9477153 16.4477153,14.5 17,14.5 Z"
          id="形状结合"
          fill="var(--primary-color)"
        />
      </g>
    </g>
  </svg>
);

export const PcIcon: React.FC<React.SVGProps<SVGSVGElement>> = (props) => (
  <svg width="20px" height="20px" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" {...props}>
    <title>icon/footer/电脑</title>
    <g id="控件" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <g id="icon/footer/Computer" fill="var(--primary-color)" fillRule="nonzero">
        <path
          d="M3,7 C3,5.8954305 3.8954305,5 5,5 L19,5 C20.1045695,5 21,5.8954305 21,7 L21,18 L21.5,18 C21.7761424,18 22,18.2238576 22,18.5 L22,19.5 C22,19.7761424 21.7761424,20 21.5,20 L2.5,20 C2.22385763,20 2,19.7761424 2,19.5 L2,18.5 C2,18.2238576 2.22385763,18 2.5,18 L3,18 L3,7 Z M19,7 L5,7 L5,16 L19,16 L19,7 Z"
          id="形状結合"
        />
      </g>
    </g>
  </svg>
);

export const PlayDisabled: React.FC<React.SVGProps<SVGSVGElement>> = (props) => (
  <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" {...props}>
    <path
      fill="none"
      stroke="currentColor"
      strokeLinecap="round"
      strokeLinejoin="round"
      strokeWidth={1.5}
      d="M2 7h19m-4.5-5l-3 5m-4-5l-3 5m5 14c-4.478 0-6.718 0-8.109-1.391S2 15.979 2 11.5c0-4.478 0-6.718 1.391-8.109S7.021 2 11.5 2c4.478 0 6.718 0 8.109 1.391S21 7.021 21 11.5M15 15l3.5 3.5m0 0L22 22m-3.5-3.5L15 22m3.5-3.5L22 15"
    />
  </svg>
);
